#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_sql_database.database[0] will be created
  + resource "google_sql_database" "database" {
      + charset   = "UTF8"
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "apps-postgres-dev"
      + name      = "module-dev-db-dev"
      + project   = "module-dev"
      + self_link = (known after apply)
    }

  # google_sql_database_instance.instance will be created
  + resource "google_sql_database_instance" "instance" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_11"
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "apps-postgres-dev"
      + private_ip_address            = (known after apply)
      + project                       = "module-dev"
      + public_ip_address             = (known after apply)
      + region                        = "europe-north1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy      = "ALWAYS"
          + availability_type      = "ZONAL"
          + crash_safe_replication = (known after apply)
          + disk_autoresize        = true
          + disk_size              = (known after apply)
          + disk_type              = "PD_SSD"
          + pricing_plan           = "PER_USE"
          + replication_type       = "SYNCHRONOUS"
          + tier                   = "db-custom-1-4096"
          + user_labels            = {
              + "created-by"   = "fredrick-myrvoll"
              + "created-on"   = "2020-04-15"
              + "created-with" = "terraform"
              + "environment"  = "dev"
            }
          + version                = (known after apply)

          + backup_configuration {
              + enabled    = true
              + start_time = "06:00"
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "projects/module-dev/global/networks/module-network"
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + zone                   = (known after apply)
            }

          + maintenance_window {
              + day          = 3
              + hour         = 7
              + update_track = "stable"
            }
        }
    }

  # google_sql_user.database_user[0] will be created
  + resource "google_sql_user" "database_user" {
      + id       = (known after apply)
      + instance = "apps-postgres-dev"
      + name     = "module_dev_user"
      + password = (sensitive value)
      + project  = "module-dev"
    }

  # kubernetes_secret.credential_secret[0] will be created
  + resource "kubernetes_secret" "credential_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "cloudsql-module-dev-db"
          + namespace        = "module-dev-namespace"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_string.password[0] will be created
  + resource "random_string" "password" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
